/*
 *****************************************************************************
 * MODULE       : DSSL_DIA_001.c
 * FUNCTION     : ＴＣＤ登録データ定義
 * VERSION      : 1.00.00
 * REMARKS      :
 * HISTORY      :
 * ID-----------DATE--------NAME----------NOTE -------------------------------
 * [V01.00.00]	2011.3.11	KOCHI    初期作成
 *****************************************************************************
 */
#define		DBG_MODE		0					/* YES=デバック中 NO=リリース */

#include <stdio.h>
#include "quemsg.h"
#include "system.h"
#include "defmilIDC.h"
#include "printff.h"

//１６個まで登録可能です。
//※注意：１６個以上は、登録しないでください。
//IDCからの受信をしない
TCD_DAT		Txxx_tcd[] = {
/* 1 */{0xF0910000,		0xFFFF0000,		0x0000,		0x0000,		0x0000,		0x0000},//TCD登録アンサー
/* 2 */{0xF1020000,		0xFFFF0000,		0x0000,		0x0000,		0x0000,		0x0000},//システム時刻通知
/* 3 */{0xF1100000 | TSK_SOUND,	0xFFFF00FF,		0x0000,		0x0000,		0x0000,		0x0000},//プロセス制御通知
/* 4 */{0xF2910000 | TSK_SOUND,	0xFFFF00FF,		0x0000,		0x0000,		0x0000,		0x0000},//起動完了待ち対策
/* 5 */{0xF2920000,		0xFFFF0000,		0x0000,		0x0000,		0x0000,		0x0000},//全タスク起動終了
/* 6 */{0x30200000,		0xFFFF0000,		0x0000,		0x0000,		0x0000,		0x0000},//スケジュール再送要求
/* 7 */{0x70200000,		0xFFFF0000,		0x0000,		0x0000,		0x0000,		0x0000},//ファイル更新通知
/* 8 */{0xFFFFFFFF,		0x00000000,		0x0000,		0x0000,		0x0000,		0x0000}	//ストッパ
} ;
